#include "data.h"

const int ALG_VERSION = 23080701;//普通版本号
const int ALG_VERSION_BIG_PRIZE = 23080702;//大奖卡版本号

//图标ID												俊丞
const int E_ICON_NULL       = 0; //无（占位符）		
const int E_ICON_PIPC1      = 1; //蘿蔔					PIC6
const int E_ICON_PIPC2      = 2; //鞭炮					PIC5
const int E_ICON_PIPC3      = 3; //銅錢					PIC4
const int E_ICON_PIPC4      = 4; //紅包					PIC3
const int E_ICON_PIPC5      = 5; //錢袋金元寶			PIC2
const int E_ICON_PIPC6      = 6; //發財金元寶			PIC1
const int E_ICON_WILD       = 7; //百搭         		WILD
const int E_ICON_PRIZE      = 8; //寶藏(Prize Symbol)	GOLD


//中奖类型
const int E_PRIZETYPE_NORMAL	  = 0;//普通盘面
const int E_PRIZETYPE_FREEGAME    = 1;//触发免费游戏盘面

const int NORMAL_DIFF = 4;       //正常难度

//中奖线路
const uint8_t gLinePos[BET_LINE_TOTAL][BOARD_COLUMN] = {
	{0,3,7},{0,4,7},{0,4,8},{1,4,7},{1,4,8},//1~5
	{1,5,8},{1,5,9},{2,5,8},{2,5,9},{2,6,9},//6~10
};

//一般图标中奖倍率
const uint16_t gIconMulti[ICON_NUM+1][BOARD_COLUMN+1] = {
    {0,0,0,0},
    {0,0,0,2},//1
    {0,0,0,3},//2
    {0,0,0,5},//3
    {0,0,0,10},//4
    {0,0,0,50},//5
    {0,0,0,100},//6
    {0,0,0,200},//7
};

//Prize Symbol 寶箱倍率
const uint32_t gPrizeSymbol[PRIZE_SYMBOL_NUM][2] = {{8,5},{9,10},{10,20},{11,50},{12,100},{13,200},{14,300},{15,500},{16,1000},{17,5000}}; //這邊要用 uint32_t 怕有小數 會丟失精度 
//BaseGame Prize Symbol Weight 寶箱倍率權重

const uint32_t gBGPrizeSymbolWeight_A[PRIZE_SYMBOL_NUM] = {77000,20000,2000,500,200,150,100,25,20,5};
const uint32_t gBGPrizeSymbolWeight_B[PRIZE_SYMBOL_NUM] = {3100,3000,1800,1000,750,300,20,15,10,5};

//每条滚轮图标数量
const uint16_t gRollerIconNum[BOARD_COLUMN] = {87,227,87};

//base game滚轮图标
const uint8_t gRollerIcon[BOARD_COLUMN][ROLLER_ICON_LEN] = {
	{7,7,7,1,1,1,8,8,2,5,5,5,2,2,2,4,4,4,1,1,1,3,3,3,2,2,2,6,1,1,2,2,3,2,2,1,1,1,6,5,4,5,4,4,4,6,6,1,2,1,1,1,3,3,5,6,5,4,4,4,8,7,7,3,3,3,1,1,1,6,6,6,2,2,2,8,8,8,1,1,1,3,8,3,2,2,8},
	{8,7,8,8,1,1,1,1,8,8,2,5,7,5,7,2,2,2,2,4,4,4,4,1,1,1,1,6,1,1,2,2,3,2,2,1,1,1,8,8,4,8,4,4,4,6,6,1,2,1,1,1,3,3,5,6,5,3,3,3,3,2,2,2,2,4,4,4,4,7,8,7,3,3,3,3,1,1,1,1,6,6,6,6,2,2,2,2,8,6,8,8,1,1,1,1,3,7,7,7,2,2,2,2,8,8,8,7,3,3,3,3,1,1,1,1,6,6,6,6,2,2,2,2,8,8,8,1,1,1,1,8,8,2,5,7,5,7,2,2,2,2,4,4,4,4,1,1,1,1,6,1,1,2,2,3,2,2,1,1,1,8,8,4,8,4,4,4,6,6,1,2,1,1,1,3,3,5,6,5,3,3,3,3,2,2,2,2,4,4,4,4,7,8,7,3,3,3,3,1,1,1,1,5,5,5,5,2,2,2,2,8,8,8,8,1,1,1,1,3,3,3,3,2,2,2,2},
	{8,7,7,1,1,1,3,8,8,8,5,5,2,2,2,4,4,4,1,1,1,3,3,3,2,2,2,6,1,1,2,2,3,2,2,1,1,1,6,5,4,5,4,4,4,6,6,1,2,1,1,1,3,3,5,6,5,4,4,4,7,7,8,3,3,3,1,1,1,6,6,6,2,2,2,1,8,8,1,1,8,3,8,3,8,2,2},
};

/*
免费游戏
*/
//Prize Number Weight 寶箱個數權重
const uint32_t gPrizeNumWeight[PRIZE_SYMBOL_NUM] = {0,60,150,250,300,110,65,40,20,5};

//Freegame Prize Symbol Weight FreeGame寶箱倍率權重
const uint32_t gFGPrizeSymbolWeight_A[PRIZE_SYMBOL_NUM] = {4000,4000,1500,280,120,50,20,15,10,5};
const uint32_t gFGPrizeSymbolWeight_B[PRIZE_SYMBOL_NUM] = {3000,3000,2000,1000,500,250,125,75,40,10};


//免费游戏每条滚轮图标数量
const uint16_t gFreeGameRollerIconNum[BOARD_COLUMN] = {47,61,47};
//免费游戏每条滚轮图标
const uint8_t gFreeGameRollerIcon[BOARD_COLUMN][ROLLER_ICON_LEN] = {
    {8,0,0,8,8,0,0,0,8,8,8,8,0,0,8,8,0,0,8,8,0,0,8,8,0,0,0,8,8,0,0,0,8,0,0,0,8,8,8,0,0,0,8,8,8,0,0},
    {8,0,0,8,8,0,0,0,8,8,8,8,0,0,8,0,0,0,8,8,0,0,8,0,0,0,0,8,8,0,0,0,8,0,0,0,8,8,8,0,0,0,8,8,8,8,0,0,0,8,8,0,0,8,0,0,0,8,8,0,0},
    {8,0,0,8,8,0,0,0,8,8,8,8,0,0,8,8,0,0,8,8,0,0,8,8,0,0,0,8,8,0,0,0,8,0,0,0,8,8,8,0,0,0,8,8,8,0,0},
};

//A、B版本对应的权重
const int gSelectVersion[SELECT_VERSION_NUM][2] = {{10000,0},{6014,3986},{3868,6132},{2581,7419},{1723,8277},{1110,8890},{650,9350},{293,9707},{0,10000}};//{A,B}
const double gTargetRTP[10][3] = 
{
    {99.5,2.6863,2.6703},{99.0,2.0137,2.0024},{98.5,1.341,1.3345},{98.0,0.6683,0.6666},{97.5,0,0},
	{97.0,2.348,2.097},{96.5,4.6807,4.1901},{96.0,7.0133,6.2832},{95.5,9.346,8.3762},{95.0,11.6787,10.4693}
};
